---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.Position
source: html/d2df4692-a7a6-9f71-2b24-20066684fe76.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.Position Property

The vertex's position.

## Syntax (C#)
```csharp
public XYZ Position { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null